#ifndef _INTERNAL_RPC_DECOMP_TYPE_DEFS_H_
#define _INTERNAL_RPC_DECOMP_TYPE_DEFS_H_


#include <string>
#include <list>
#include <vector>


#include "..\RpcCommon\RpcView.h"
#include "RpcDecompiler.h"

extern boolean robustFlagWasSet;
extern BOOL is64B;





////////////////////////////////////////////////////////////////////////////////
// Private types declaration
////////////////////////////////////////////////////////////////////////////////
typedef struct _RpcDecompilerCtxt_T{
	RpcViewHelper_T*		pRpcViewHelper;
	RpcDecompilerInfo_T*	pRpcDecompilerInfo;
	RpcModuleInfo_T*		pRpcModuleInfo;
	//...
}RpcDecompilerCtxt_T;

#ifdef _DEBUG
#define DEBUG_BREAK() __debugbreak()
#define DEBUG_EXIT(x)	ExitProcess(x)
#else
#define DEBUG_BREAK()
#define DEBUG_EXIT(x)
#endif

#define DEFAULT_IF_NAME "DefaultIfName"
#define RPC_DECOMPILER_INVALID_TYPE_SIZE	((UINT)-1)
#define RPC_DECOMPILER_INVALID_PARAM_SIZE	((UINT)-1)
//#define RPC_DEBUG_FN	pRpcDecompilerCtxt->pRpcViewHelper->RpcDebug
#define RPC_ERROR_FN(x)		printf("[%s] error %s",__FUNCTION__,x);
#define RPC_DEBUG_FN(...)    printf((const char*)__VA_ARGS__)
#define RPC_PRINT_FN	pRpcDecompilerCtxt->pRpcViewHelper->RpcPrint
#define RPC_ALLOC_FN	pRpcDecompilerCtxt->pRpcViewHelper->RpcAlloc
#define RPC_FREE_FN		pRpcDecompilerCtxt->pRpcViewHelper->RpcFree
#define RPC_GET_PROCESS_DATA( pAddress, pBuffer, BufferLength)												\
{																											\
	/*BOOL	bResult;*/																						\
	\
	bResult = pRpcDecompilerCtxt->pRpcViewHelper->RpcGetProcessData(pRpcDecompilerCtxt->pRpcModuleInfo, pAddress, pBuffer, BufferLength);	\
	if(bResult == FALSE)																					\
{																										\
	RPC_DEBUG_FN((UCHAR*)"\n!!! source = %s ligne = %d - ERROR RpcGetProcessData", __FILE__, __LINE__);					\
	*((UCHAR*)NULL)=0;																				\
}																										\
}
#define RPC_GET_PROCESS_DATA2( pAddress, pBuffer, BufferLength)	pRpcDecompilerCtxt->pRpcViewHelper->RpcGetProcessData(pRpcDecompilerCtxt->pRpcModuleInfo, pAddress, pBuffer, BufferLength)											\

#define ERROR_ZERO_TYPEOFFSET_MSG "\nERROR: TypeOffset == 0 whereas Type is not simple Type\n"


#define NB_DIGIT_MAX_INT_32BITS_BASE_10		11	//2^32 = 4294967296 ==> 10 caractères ou word
//2^31 = 2147483648 + signe ==> 11 caractères ou word
#define BASE_10								10

#define EMPTY_PARAM_ATTR					0x0000

#define VIRTUAL_STACK_OFFSET_GRANULARITY_32B	4
#define VIRTUAL_STACK_OFFSET_GRANULARITY_64B	8
#define VIRTUAL_STACK_OFFSET_GRANULARITY			(is64B?VIRTUAL_STACK_OFFSET_GRANULARITY_64B:VIRTUAL_STACK_OFFSET_GRANULARITY_32B)



////////////////////////////////////////////////////////////////////////////////
// Codes retour de fonctions
////////////////////////////////////////////////////////////////////////////////
typedef enum RpcDecompilerErrorCodes_E
{
	RPC_DECOMP_SUCCESS	= 0,
	RPC_DECOMP_ERROR	= 1,
	RPC_DECOMP_NULL_PTR	= 2,
	RPC_DECOMP_NEED_MORE_SOURCE_BYTE = 3
}RpcDecompilerErrorCodes_E;

////////////////////////////////////////////////////////////////////////////////
// _MIDL_PROC_FORMAT_STRING types
////////////////////////////////////////////////////////////////////////////////

// types de headers possibles
typedef enum HeaderID_E
{
	oi,				// voir typedef struct Oi_Header_t
	oif,			// voir typedef struct Oif_Header_t
	win2kext,		// voir typedef struct Win2kExt_Header_t

	undefHeaderType
}HeaderID_E;

//------------------------------------------------------------------------------
// _MIDL_PROC_FORMAT_STRING types :
// HANDLE types
//------------------------------------------------------------------------------
// handle_type values
//#define FC_BIND_CONTEXT		0x30
//#define FC_BIND_GENERIC		0x31
//#define FC_BIND_PRIMITIVE	0x32
//#define FC_AUTO_HANDLE		0x33
//#define FC_CALLBACK_HANDLE	0x34
#define FC_EXPLICIT_HANDLE	0x00

#pragma pack(push, 1) // Align all structure on 1 byte

typedef struct ExplicitHandlePrimitive_t
{
	unsigned char	flag;
	unsigned short	offset;
}ExplicitHandlePrimitive_t;

typedef struct ExplicitHandleGeneric_t
{
	unsigned char	flagAndSize;
	unsigned short	offset;
	unsigned char	binding_routine_pair_index;
	unsigned char	pad;
}ExplicitHandleGeneric_t;

typedef struct ExplicitHandleContext_t
{
	unsigned char	flags;
	unsigned short	offset;
	unsigned char	context_rundown_routine_index;
	unsigned char	param_num;
}ExplicitHandleContext_t;

typedef union ExplicitHandle_U
{
	ExplicitHandlePrimitive_t	explicitHandlePrimitive;
	ExplicitHandleGeneric_t		explicitHandleGeneric;
	ExplicitHandleContext_t		explicitHandleContext;
}ExplicitHandle_U;

#define EXPLICIT_HANDLE_MIN_SIZE		4		// EXPLICIT_HANDLE_PRIMITIVE_SIZE
#define EXPLICIT_HANDLE_PRIMITIVE_SIZE	4		// sizeof(ExplicitHandle_t.htype) + sizeof(ExplicitHandlePrimitive_t)
#define EXPLICIT_HANDLE_GENERIC_SIZE	6		// sizeof(ExplicitHandle_t.htype) + sizeof(ExplicitHandleGeneric_t)
#define EXPLICIT_HANDLE_CONTEXT_SIZE	6		// sizeof(ExplicitHandle_t.htype) + sizeof(ExplicitHandleContext_t)
typedef struct ExplicitHandle_t
{
	unsigned char		htype;		// voir handle_type values
	ExplicitHandle_U	hContent;
}ExplicitHandle_t;



//------------------------------------------------------------------------------
// _MIDL_PROC_FORMAT_STRING types :
// OI header types
//------------------------------------------------------------------------------
//oi_flags values
#define Oi_FULL_PTR_USED			0x01	//Uses the full pointer package
#define Oi_RPCSS_ALLOC_USED			0x02	//Uses the RpcSs memory package
#define Oi_OBJECT_PROC				0x04	//A procedure in an object interface
#define Oi_HAS_RPCFLAGS				0x08	//The procedure has Rpc flags
#define Oi_star10					0x10	//Overloaded
#define Oi_star20					0x20	//Overloaded
#define Oi_USE_NEW_INIT_ROUTINES	0x40	//Uses Windows NT3.5 Beta2+ init routines
#define Oi_Unused					0x80	//Unused

//oi_flags values : the following flags are overloaded
#define ENCODE_IS_USED				0x10	//Used only in pickling
#define DECODE_IS_USED				0x20	//Used only in pickling
#define Oi_IGNORE_OBJECT_EXCEPTION_HANDLING	0x10	//Not used any more (old OLE)
#define	Oi_HAS_COMM_OR_FAULT		0x20	//In raw RPC only, [comm _, fault_status]
#define Oi_OBJ_USE_V2_INTERPRETER	0x20	//In DCOM only, use -Oif interpreter






typedef struct Oi_Header_1stPart_t
{
	unsigned char		handle_type;	// voir handle_type values
	unsigned char		oi_flags;		// voir oi_flags values
}Oi_Header_1stPart_t;


typedef struct Oi_Header_RpcFlags_t
{
	unsigned char rpc_flags[4];
}Oi_Header_RpcFlags_t;

typedef struct Oi_Header_3rdPart_t
{
	unsigned short		procNum;		// provides the procedure's procedure number
	unsigned short		stack_size;		/* provides the total size of all parameters on the stack, 
										including any this pointer and/or return value */
}Oi_Header_3rdPart_t;

#define OI_EXT_HEADER_BASE_SIZE	6
#define OI_EXT_HEADER_OIFLAGS_SIZE 4 // si oi_flags contient flag Oi_HAS_RPCFLAGS
typedef struct Oi_Header_t
{
	unsigned char			handle_type;	// voir handle_type values
	unsigned char			oi_flags;		// voir oi_flags values
	Oi_Header_RpcFlags_t *	pRpcFlags;		// != NULL si oi_flags contient Oi_HAS_RPCFLAGS sinon NULL
	unsigned short			procNum;		// provides the procedure's procedure number
	unsigned short			stack_size;		/* provides the total size of all parameters on the stack, 
											including any this pointer and/or return value */
	ExplicitHandle_t *	explicitHandleDescr; /* NULL si handle_type != FC_EXPLICIT_HANDLE */
}Oi_Header_t;

//------------------------------------------------------------------------------
// _MIDL_PROC_FORMAT_STRING types :
// OIF header types
//------------------------------------------------------------------------------
//interpreter_opt_flag values
typedef struct INTERPRETER_OPT_FLAGS
{
	unsigned char   ServerMustSize      : 1;    // 0x01 set if the server needs to perform a buffer sizing pass
	unsigned char   ClientMustSize      : 1;    // 0x02 set if the client needs to perform a buffer sizing pass
	unsigned char   HasReturn           : 1;    // 0x04 set if the procedure has a return value
	unsigned char   HasPipes            : 1;    // 0x08 set if the pipe package needs to be used to support a pipe argument
	unsigned char   Unused              : 1;
	unsigned char   HasAsyncUuid        : 1;    // 0x20 set if the procedure is a, asynchronous DCOM procedure
	unsigned char   HasExtensions       : 1;    // 0x40 indicates that Windows 2000 and later extensions are used, voir Win2kExt_Header_t
	unsigned char   HasAsyncHandle      : 1;    /* 0x80 indicates an asynchronous RPC procedure 
												The HasAsyncHandle bit has been initially used for a different DCOM implementation 
												of async support, and hence could not be used for the current style async support 
												in DCOM. The HasAsyncUuid bit currently indicates this. */
} INTERPRETER_OPT_FLAGS, *PINTERPRETER_OPT_FLAGS;

#define OIF_EXT_HEADER_SIZE	6
typedef struct Oif_Header_t
{
	//	Oi_Header_t				oiHeader;					// Voir Oi_Header_t
	unsigned short			constant_client_buffer_size;/* Provides the size of the marshaling buffer that could have
														been precomputed by the compiler. This may be only a partial size,
														as the CLIENT_MUST_SIZE flag triggers the sizing. */
	unsigned short			constant_server_buffer_size;/* Provides the size of the marshaling buffer that could have
														been precomputed by the compiler. This may be only a partial size,
														as the SERVER_MUST_SIZE flag triggers the sizing. */
	INTERPRETER_OPT_FLAGS	interpreter_opt_flag;		// Voir interpreter_opt_flag values
	unsigned char			number_of_param;			// Nombre de paramètres décrits de la procédure, return compris
}Oif_Header_t, OIF_HEADER_T;

//------------------------------------------------------------------------------
// _MIDL_PROC_FORMAT_STRING types :
// WIN2KEXT header types
//------------------------------------------------------------------------------
//interpreter_opt_flag2 values
typedef struct INTERPRETER_OPT_FLAGS2
{
	unsigned char   HasNewCorrDesc      : 1;    /* 0x01 The HasNewCorrDesc member indicates whether new correlation descriptors 
												are used in the format strings generated by the compiler. The new correlation
												descriptor is related to the denial-of-attack functionality. The ClientCorrCheck
												and ServerCorrCheck members are set when the routine needs the correlation check
												on the indicated side. */
	unsigned char   ClientCorrCheck     : 1;    /* 0x02 The ClientCorrCheck member is a cache size hint on the client side and
												ServerCorrCheck is a hint on the server side. When the size comes out as zero,
												a default size should be used. */
	unsigned char   ServerCorrCheck     : 1;    /* 0x04 The ClientCorrCheck member is a cache size hint on the client side and
												ServerCorrCheck is a hint on the server side. When the size comes out as zero,
												a default size should be used. */
	unsigned char   HasNotify           : 1;    /* 0x08 The HasNotify and HasNotify2 flags indicate that the routine uses the notify 
												feature as defined by the [notify] and [notify_flag] attributes, respectively. */
	unsigned char   HasNotify2          : 1;    /* 0x10 The HasNotify and HasNotify2 flags indicate that the routine uses the notify 
												feature as defined by the [notify] and [notify_flag] attributes, respectively. */
	unsigned char   HasComplexReturn	: 1;	/* 0x20 Undocumented flag. Unknown purpose */
	unsigned char   HasRangeOnConf		: 1;	/* 0x40 Undocumented flag. If set, check for range information within NDR structures (array...) */
	unsigned char	HasBigByValueParam	: 1;    /* 0x80 Undocumented flag. Purpose unknown so far. */

} INTERPRETER_OPT_FLAGS2, *PINTERPRETER_OPT_FLAGS2;

typedef UINT16 FloatDoubleMask_t;	/* The FloatDoubleMask element addresses the issue of a floating point argument for 64-bit Windows.
									This field is generated only for 64-bit stubs. The mask is needed for the assembly routines that
									download/upload registers from/to the virtual stack to handle floating-point arguments and registers
									properly. The mask consist of 2 bits per argument, or rather per floating-point register.
									The coding is as follows: The least significant bits correspond to the first FP register, the next 2
									bits correspond to the second register, and so on. */

#define WIN2K_EXT_HEADER_32B_SIZE	sizeof(Win2kExt_Header_t) - sizeof(FloatDoubleMask_t)
#define WIN2K_EXT_HEADER_64B_SIZE	sizeof(Win2kExt_Header_t) /* TODO : verifier avec test car valeur 12 extraite de la doc MSDN mais doute sur valeur 
									car somme taille des champs = 10 pas 12... */
typedef struct Win2kExt_Header_t
{
	//	Oif_Header_t			oifHeader;				// Voir Oif_Header_t
	unsigned char			extension_version;		/* Provides the size of the Win2kExt section in bytes. Doing so
													make it possible for the current NDR engine to step over the extension
													section correctly even if the section were to come from a mater compiler
													version with more fields than the current engine understands.
													*/
	INTERPRETER_OPT_FLAGS2	interpreter_opt_flag2;	// Voir interpreter_opt_flag2 values
	unsigned short			clientCorrHint;			/* The ClientCorrCheck member is a cache size hint on the client side and
													ServerCorrCheck is a hint on the server side. When the size comes out as zero,
													a default size should be used. */ 
	unsigned short			serverCorrHint;
	unsigned short			notifyIndex;			// TODO ? : The NotifyIndex element is an index to a notify routine, if one is used.
	FloatDoubleMask_t 		floatDoubleMask;		/* Si extension_version == WIN2K_EXT_HEADER_32B_SIZE floatDoubleMask est non présent,
													sinon si extension_version == WIN2K_EXT_HEADER_64B_SIZE floatDoubleMask est présent */
}Win2kExt_Header_t;



//
// Oi Header
typedef struct _OI_HEADER_BEGINNING_T
{
	BYTE				bHandle_type;
	BYTE				bOi_flags;
}OI_HEADER_BEGINNING_T;

typedef struct _OI_HEADER_END_T
{
	WORD				wProc_num;
	WORD				wStack_size;
	//	[explicit_handle_description<>]
}OI_HEADER_END_T;

typedef struct _OI_HEADER_T
{
	OI_HEADER_BEGINNING_T	beginning;
	DWORD					dwRpc_flags;
	OI_HEADER_END_T			end;
}OI_HEADER_T;

//
// Procedure header
typedef struct  _PROC_HEADER_T
{
	OI_HEADER_T				oiHeader;
	ExplicitHandle_t		explicitHandle;
	OIF_HEADER_T			oifheader;
	Win2kExt_Header_t		win2KextHeader;
}PROC_HEADER_T;



//------------------------------------------------------------------------------
// _MIDL_PROC_FORMAT_STRING types :
// UNION HEADER type (OI / OIF / WIN2KEXT)
//------------------------------------------------------------------------------
typedef union ProcFormatStringHeader_U
{
	Oi_Header_t			oiHeader;
	Oif_Header_t		oifHeader;
	Win2kExt_Header_t	win2kHeader;
}ProcFormatStringHeader_U;

typedef struct ProcFormatStringHeader_t
{
	HeaderID_E					headerTypeID; // Voir HeaderID_E
	unsigned int				headerEffectiveSize; /* OI_EXT_HEADER_BASE_SIZE si headerTypeID == oi 
													 ou OI_EXT_HEADER_OIFLAGS_SIZE  si headerTypeID == oi et Oi_Header_t.oi_flags contient Oi_HAS_RPCFLAGS

													 + OIF_EXT_HEADER_SIZE si headerTypeID == oif ou headerTypeID == win2kext
													 + Win2kExt_Header_t.extension_version si headerTypeID == win2kext */

	ProcFormatStringHeader_U	headerContent; /* Voir Oi_Header_t si HeaderID_E == oi
											   Voir Oif_Header_t si HeaderID_E == oif
											   Voir Win2kExt_Header_t si HeaderID_E == win2kext */
}ProcFormatStringHeader_t;

//------------------------------------------------------------------------------
// _MIDL_PROC_FORMAT_STRING types :
// PARAM types
//------------------------------------------------------------------------------
// types de param descriptor possibles
typedef enum ParamID_E
{
	paramDescrOi,	// voir typedef struct ParamDescriptor_oi_t, Possible uniquement en environnement 32bits
	paramDescrOif,	// voir typedef struct ParamDescriptor_oif_t
}ParamID_E;

//------------------------------------------------------------------------------
// _MIDL_PROC_FORMAT_STRING types :
// OI PARAM descriptor types - The -Oi mode is not supported on 64-bit platforms
//------------------------------------------------------------------------------
typedef struct OiParamComplexType_t
{
	unsigned char	stack_size;		/* The stack_size<1> is the size of the parameter on the stack, expressed 
									as the number of integers the parameter occupies on the stack. */
	unsigned short	type_offset;	/* The type_offset<2> field is the offset in the type format string table, 
									indicating the type descriptor for the argument. */

}OiParamComplexType_t;

typedef unsigned char OiParamSimpleType_t;

typedef union OiParamType_U
{
	OiParamSimpleType_t		simple_type;
	OiParamComplexType_t	complex_type;
}OiParamType_U;

// param_direction values
//#define FC_IN_PARAM_BASETYPE		0x4e
//#define FC_RETURN_PARAM_BASETYPE	0x53
//#define FC_IN_PARAM					0x4d
//#define FC_IN_OUT_PARAM				0x50
//#define FC_OUT_PARAM				0x51
//#define FC_RETURN_PARAM				0x52 //A procedure return value
//#define FC_IN_PARAM_NO_FREE_INST	0x4f //An in xmit/rep as a parameter for which no freeing is made.

typedef struct ParamDescriptor_oi_t // The -Oi mode is not supported on 64-bit platforms
{
	unsigned short			param_direction; // Voir param_direction values
	OiParamType_U			paramType; /* Si param_direction == FC_IN_PARAM_BASETYPE ou FC_RETURN_PARAM_BASETYPE
									   Alors paramType est de type OiParamSimpleType_t
									   Sinon paramType est de type OiParamComplexType_t */
}ParamDescriptor_oi_t;

//------------------------------------------------------------------------------
// _MIDL_PROC_FORMAT_STRING types :
// OIF PARAM descriptor types
//------------------------------------------------------------------------------
//OIF paramAttributes values
typedef struct PARAM_ATTRIBUTES
{
	unsigned short  MustSize            : 1;    // 0x0001 set only if the parameter must be sized
	unsigned short  MustFree            : 1;    // 0x0002 set if the server must call the parameter's NdrFree* routine
	unsigned short  IsPipe              : 1;    // 0x0004
	unsigned short  IsIn                : 1;    // 0x0008
	unsigned short  IsOut               : 1;    // 0x0010
	unsigned short  IsReturn            : 1;    // 0x0020
	unsigned short  IsBasetype          : 1;    /* 0x0040 set for simple types that are being marshaled by the main –Oif 
												interpreter loop. In particular, a simple type with a range 
												attribute on it is not flagged as a base type in order to force 
												the range routine marshaling through dispatching using an FC_RANGE 
												token.
												*/
	unsigned short  IsByValue           : 1;    /* 0x0080 set for compound types being sent by value, but is not set for simple 
												types, regardless of whether the argument is a pointer. The compound 
												types for which it is set are structures, unions, transmit_as, 
												represent_as, wire_marshal and SAFEARRAY. In general, the bit was 
												introduced for the benefit of the main interpreter loop in the –Oicf 
												interpreter, to ensure the nonsimple arguments (refe		rred to as compound 
												type arguments) are properly dereferenced. This bit was never used in 
												previous versions of the interpreter.
												*/
	unsigned short  IsSimpleRef         : 1;    /* 0x0100 set for a parameter that is a reference pointer to anything 
												other than another pointer, and which has no allocate attributes.
												For such a type, the parameter description's type_offset<> field, 
												except for a reference pointer to a base type, provides the offset 
												to the referent's type; the reference pointer is simply skipped.
												*/
	unsigned short  IsDontCallFreeInst  : 1;    // 0x0200 set for certain represent_as parameters whose free instance routines should not be called.
	unsigned short  SaveForAsyncFinish  : 1;    // 0x0400
	unsigned short  IsPartialIgnore     : 1;	/* 0x0800 Undocumented flag. Unknown purpose */
	unsigned short	IsForceAllocate		: 1;	/* 0x1000 Undocumented flag. Unknown purpose */
	unsigned short  ServerAllocSize     : 3;    /* 0xe000 bits are nonzero if the parameter is [ out], [ in], or [ in,out] 
												pointer to pointer, or pointer to enum16, and will be initialized 
												on the server interpreter's stack, rather than using a call to 
												I_RpcAllocate. If nonzero, this value is multiplied by 8 to get 
												the number of bytes for the parameter. Note that doing so means at 
												least 8 bytes are always allocated for a pointer. */

} PARAM_ATTRIBUTES, *PPARAM_ATTRIBUTES;


typedef struct ParamDescrOifBaseType_t
{
	unsigned char type_format_char;		/* For base types, the argument type is given directly by the format character 
										corresponding to the type.  */
	unsigned char unused;
}ParamDescrOifBaseType_t;

typedef unsigned short ParamDescrOifOtherType_t;

typedef union OifParamType_U
{
	ParamDescrOifBaseType_t		base_type_format_char; // Voir ParamDescrOifBaseType_t
